# Parameter Utils Get Built In Parameter Group Type Id Method

Source: https://www.revitapidocs.com/2026/9cea4e68-53ab-c371-f8b2-b205d75b4ec8.htm

---

| Parameter Utils Get Built In Parameter Group Type Id Method |
| --- |

The parameter group identifier corresponding to the given built\-in parameter identifier.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId GetBuiltInParameterGroupTypeId(
	ForgeTypeId parameterTypeId
)
```

```
Public Shared Function GetBuiltInParameterGroupTypeId (
	parameterTypeId As ForgeTypeId
) As ForgeTypeId
```

```
public:
static ForgeTypeId^ GetBuiltInParameterGroupTypeId(
	ForgeTypeId^ parameterTypeId
)
```

```
static member GetBuiltInParameterGroupTypeId :
        parameterTypeId : ForgeTypeId -> ForgeTypeId
```

#### Parameters

parameterTypeId ForgeTypeId
:   The identifier to check.

#### Return Value

ForgeTypeId
The parameter group identifier. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

Remarks A ForgeTypeId identifies a built\-in parameter if it corresponds to a valid BuiltInParameter value. See Also

#### Reference

ParameterUtils Class Autodesk.Revit.DB Namespace